Repository: QingYaoSheep/amll-player
Catalog: AMLLPlayer/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# render.credits.lyricAuthor
source: Only lyric contributors
zh_hans: 仅显示歌词作者

# render.credits.songwriters
source: Only songwriters
zh_hans: 仅显示词曲作者

# render.credits.preferLyricAuthor
source: Prefer lyric contributors
zh_hans: 优先显示歌词作者

# render.credits.preferSongwriters
source: Prefer songwriters
zh_hans: 优先显示词曲作者

# render.creditLabel.lyricAuthor
source: Lyrics contributed by
zh_hans: 歌词作者

# render.creditLabel.songwriters
source: Songwriters
zh_hans: 词曲作者

# render.lyrics
source: Synchronized lyrics
zh_hans: 同步歌词

# render.interlude
source: Instrumental interlude
zh_hans: 前奏或间奏

# render.seekHint
source: Play from this lyric
zh_hans: 从这一行开始播放

# render.returnCurrent
source: Return to current lyrics
zh_hans: 返回当前歌词

# render.settings
source: Lyrics appearance
zh_hans: 歌词外观

# render.frameRate
source: Replay frame rate
zh_hans: 回放帧率

# render.stepBackward
source: Previous frame
zh_hans: 上一帧

# render.stepForward
source: Next frame
zh_hans: 下一帧

# render.profile
source: Player layout
zh_hans: 播放器布局

# render.profile.custom
source: Legacy custom layout
zh_hans: 旧版自定义布局

# render.profile.help
source: Apple Music controls the page layout. Lyric motion and typography always use the native AMLL engine.
zh_hans: Apple Music 只作为页面布局参考；歌词动效与排版始终由原生 AMLL 引擎提供。

# render.options
source: Display options
zh_hans: 显示选项

# render.hideLyrics
source: Hide lyrics
zh_hans: 隐藏歌词

# render.showLyrics
source: Show lyrics
zh_hans: 显示歌词

# render.typography
source: Typography
zh_hans: 文字排版

# render.sample
source: Every word, in its own time
zh_hans: 每一个字，都有自己的时刻

# render.fontSize
source: Text size
zh_hans: 字号

# render.small
source: Small
zh_hans: 小

# render.medium
source: Medium
zh_hans: 中

# render.large
source: Large
zh_hans: 大

# render.extraLarge
source: Extra large
zh_hans: 特大

# render.bold
source: Bold lyrics
zh_hans: 加粗歌词

# render.tracking
source: Letter spacing
zh_hans: 字距

# render.translation
source: Translation
zh_hans: 翻译

# render.romanization
source: Romanization
zh_hans: 音译

# render.romanizationFirst
source: Romanization above translation
zh_hans: 音译显示在翻译上方

# render.motion
source: Highlight and motion
zh_hans: 高亮与动画

# render.blurInactive
source: Blur inactive lines
zh_hans: 模糊非当前行

# render.emphasizeWords
source: Lift active words
zh_hans: 正在演唱的字轻微上浮

# render.marquee
source: Scroll long titles
zh_hans: 滚动显示长曲名与艺人

# render.gradientWidth
source: Word gradient width
zh_hans: 逐字渐变宽度

# render.advance
source: Scroll ahead
zh_hans: 提前滚动

# render.anchor
source: Current line position
zh_hans: 当前行对齐位置

# render.advanceHelp
source: Scroll ahead moves the view only. Lyric timing and the per-song delay stay independent.
zh_hans: 提前滚动只改变视图位置，不改变真实词时间；逐曲延迟单独生效。

# render.layout
source: Layout and visibility
zh_hans: 布局与显示

# render.coverLayout
source: Cover layout
zh_hans: 封面布局

# render.layout.automatic
source: Automatic
zh_hans: 自动

# render.layout.normal
source: Normal
zh_hans: 普通

# render.layout.immersive
source: Immersive
zh_hans: 沉浸

# render.showTitle
source: Song title
zh_hans: 曲名

# render.showArtist
source: Artists
zh_hans: 艺人

# render.showAlbum
source: Album
zh_hans: 专辑

# render.showControls
source: Playback controls
zh_hans: 底部播放控制

# render.volume
source: Volume
zh_hans: 音量

# render.credits
source: Lyric credits
zh_hans: 歌词署名

# render.credits.hidden
source: Hidden
zh_hans: 隐藏

# render.credits.visible
source: Below lyrics
zh_hans: 在歌词下方显示

# render.credits.preferred
source: Below song information
zh_hans: 优先在歌曲信息下方显示

# render.background
source: Static cover background
zh_hans: 静态封面背景

# render.backgroundBlur
source: Background blur
zh_hans: 背景模糊

# render.backgroundHelp
source: The album cover fills the screen without stretching. Blur stays at your chosen strength. Without artwork, a solid background is shown.
zh_hans: 专辑封面保持比例、裁切铺满屏幕。模糊保持所选强度；没有封面时显示纯色。

# render.reset
source: Reset appearance
zh_hans: 恢复默认外观

# render.debug
source: Lyrics rendering preview
zh_hans: 歌词渲染预览

# render.progress
source: Playback position
zh_hans: 播放进度

# render.restart
source: Restart preview
zh_hans: 从头预览

# render.stopMarquee
source: Double-tap to stop scrolling
zh_hans: 轻点两下停止滚动

# render.resumeMarquee
source: Double-tap to resume scrolling
zh_hans: 轻点两下恢复滚动

# render.remainingTime
source: Remaining time
zh_hans: 剩余时间

# render.elapsedTime
source: Elapsed time
zh_hans: 已播放时间

# render.toggleTime
source: Switch between elapsed and remaining time
zh_hans: 切换已播放与剩余时间

# render.previewSample
source: Preview sample
zh_hans: 预览样本

# render.preview.word
source: Word timing and voices
zh_hans: 逐字与多声部

# render.preview.line
source: Line timing
zh_hans: 逐行歌词

# render.preview.background
source: Synthetic album cover
zh_hans: 合成专辑封面

# lyrics.title
source: Lyrics
zh_hans: 歌词

source: Lyrics settings
zh_hans: 歌词设置

# lyrics.find
source: Find or correct lyrics
zh_hans: 搜索与纠正歌词

# lyrics.refresh
source: Force rematch / refresh locked lyrics
zh_hans: 强制重新匹配／刷新锁定歌词

# lyrics.automatic
source: Restore automatic matching
zh_hans: 恢复自动匹配

# lyrics.offset.minus
source: Earlier by 0.1 s
zh_hans: 提前 0.1 秒

# lyrics.offset.plus
source: Later by 0.1 s
zh_hans: 延后 0.1 秒

# lyrics.offset.zero
source: Reset timing offset
zh_hans: 延迟归零

source: Lyrics actions
zh_hans: 歌词快捷操作

# lyrics.evidence
source: Matching and parsing details
zh_hans: 匹配与解析详情

# lyrics.status.idle
source: Waiting for a song
zh_hans: 等待歌曲

# lyrics.status.disabled
source: Lyrics disabled
zh_hans: 歌词已关闭

# lyrics.status.loading
source: Finding lyrics…
zh_hans: 正在获取歌词…

# lyrics.status.ready
source: Lyrics ready
zh_hans: 歌词已加载

# lyrics.status.cached
source: Using cached lyrics
zh_hans: 使用缓存歌词

# lyrics.status.stale
source: Cached lyrics retained; refresh pending or failed
zh_hans: 保留已有歌词；等待刷新或刷新失败

# lyrics.status.instrumental
source: Marked as instrumental by the source
zh_hans: 来源标记为纯音乐

# lyrics.status.notFound
source: No synchronized lyrics found
zh_hans: 未找到同步歌词

# lyrics.status.failed
source: Lyrics sources unavailable
zh_hans: 歌词来源暂不可用

# lyrics.precision.word
source: Word timing
zh_hans: 逐字精度

# lyrics.precision.line
source: Line timing
zh_hans: 逐行精度

# lyrics.match.auto
source: Automatic
zh_hans: 自动匹配

# lyrics.match.manual
source: Manual · locked
zh_hans: 人工选择 · 已锁定

# lyrics.background
source: Background vocals
zh_hans: 背景声部

# lyrics.search.prompt
source: Title, artist or album
zh_hans: 歌曲、艺人或专辑

# lyrics.preview
source: Preview lyrics
zh_hans: 歌词预览

# lyrics.preview.loading
source: Loading preview…
zh_hans: 正在加载预览…

# lyrics.apply
source: Apply and lock
zh_hans: 应用并锁定

# lyrics.enabled
source: Enable lyrics
zh_hans: 启用歌词

# lyrics.priority
source: Source priority
zh_hans: 来源优先级

# lyrics.priority.help
source: Tap Edit to reorder. Failed sources fall through to the next one. Manual matches remain locked.
zh_hans: 点击编辑调整顺序。来源失败时继续尝试下一源；人工匹配保持锁定。

# lyrics.cache
source: Cache
zh_hans: 缓存

# lyrics.cache.enabled
source: Cache lyrics
zh_hans: 缓存歌词

# lyrics.cache.days
source: Refresh after (days)
zh_hans: 自动刷新天数

# lyrics.cache.clear
source: Clear lyric cache
zh_hans: 清除歌词缓存

# lyrics.matches.reset
source: Reset manual matches
zh_hans: 重置人工匹配

# lyrics.cache.help
source: 0 means never expire. Expired lyrics appear immediately and refresh only in the foreground. Manual matches and timing offsets are stored separately.
zh_hans: 0 表示永不过期。过期歌词先展示，仅在应用前台异步刷新。人工匹配与延迟单独保存。

# lyrics.cache.clear.help
source: Deletes cached raw and parsed lyrics. Keeps manual choices, timing offsets and credentials; the currently displayed lyrics remain until replaced.
zh_hans: 删除缓存原文与解析结果。保留人工选择、延迟与凭据；当前显示的歌词会保留至被替换。

# lyrics.matches.reset.help
source: Removes manual locks for all songs. Keeps lyric cache, timing offsets and credentials.
zh_hans: 解除所有歌曲的人工匹配锁定。保留歌词缓存、延迟与凭据。

# lyrics.offset
source: Timing offset for this song
zh_hans: 当前歌曲歌词延迟

# lyrics.offset.help
source: Positive values delay lyrics; negative values advance them. Range: ±10 seconds. This does not seek Spotify.
zh_hans: 正值延后歌词，负值提前歌词，范围 ±10 秒。不会改变 Spotify 播放进度。

# lyrics.confirm
source: Confirm operation
zh_hans: 确认操作

# lyrics.delete
source: Delete
zh_hans: 删除

# lyrics.save
source: Save configuration
zh_hans: 保存配置

# lyrics.saved
source: Saved
zh_hans: 已保存

# lyrics.apple.settings
source: Apple Music lyrics
zh_hans: Apple Music 歌词

# lyrics.apple.region
source: Region and translation
zh_hans: 地区与翻译

# lyrics.apple.storefront
source: Storefront (us)
zh_hans: Storefront（默认 us）

# lyrics.apple.language
source: Translation language (zh-Hans-CN)
zh_hans: 翻译语言（默认 zh-Hans-CN）

# lyrics.apple.account
source: Media user token
zh_hans: 账号凭据

# lyrics.apple.credentials.help
source: Use a media-user-token from your own Apple Music web session. It may require an active subscription. Stored only in this device’s Keychain, not in lyric cache or diagnostics. This is not your password and is independent of Spotify login.
zh_hans: 使用你本人 Apple Music 网页会话的 media-user-token，可能需要有效订阅。仅保存在本机 Keychain，不进入歌词缓存或诊断。它不是账号密码，与 Spotify 登录无关。

# lyrics.apple.bearer
source: Catalog bearer (advanced)
zh_hans: Catalog bearer（高级）

# lyrics.apple.bearer.help
source: Discovers AMPWebPlay tokens from Apple’s public web assets without executing scripts. A manual token takes priority. Expiry/format checks do not verify its signature. Unofficial endpoints may change or reject a region/account.
zh_hans: 从 Apple 公开网页资源发现 AMPWebPlay 令牌，不执行脚本。手动令牌优先。格式/到期检查不代表签名认证；非公开接口可能变化，或限制地区与账号。

# lyrics.apple.discover
source: Refresh automatic bearer
zh_hans: 刷新自动 bearer

# lyrics.apple.discovered
source: Bearer format and expiry checked (not signature verified).
zh_hans: 已检查 bearer 格式和有效期（未验证签名）。

# lyrics.apple.clearAutomatic
source: Clear automatic bearer
zh_hans: 清除自动 bearer

# lyrics.apple.diagnostics
source: Connection diagnostics
zh_hans: 连接诊断

# lyrics.apple.testCatalog
source: Test public Catalog bearer
zh_hans: 验证公共 Catalog bearer

# lyrics.apple.testAccount
source: Test account media-user-token
zh_hans: 验证账号 media-user-token

# lyrics.apple.catalogOK
source: Public Catalog check passed; lyric access has not been verified.
zh_hans: 公共 Catalog 验证通过；不代表已取得歌词权限。

# lyrics.apple.accountOK
source: Account check passed; lyric access is checked per song and region.
zh_hans: 账号验证通过；歌词权限仍需按歌曲和地区验证。

# lyrics.apple.expires
source: Cached automatic bearer expires:
zh_hans: 自动 bearer 到期：

# lyrics.apple.noAutomatic
source: No valid automatic bearer cached; it will be discovered on demand.
zh_hans: 尚无有效自动 bearer 缓存，将按需获取。

# lyrics.credential.saved
source: Credential saved in Keychain
zh_hans: 凭据已保存到 Keychain

# lyrics.credential.empty
source: Not configured
zh_hans: 尚未配置

# lyrics.credential.saveMedia
source: Save media-user-token
zh_hans: 保存 media-user-token

# lyrics.credential.deleteMedia
source: Delete media-user-token
zh_hans: 删除 media-user-token

# lyrics.credential.saveManual
source: Save manual bearer
zh_hans: 保存手动 bearer

# lyrics.credential.deleteManual
source: Delete manual bearer
zh_hans: 删除手动 bearer

# lyrics.credential.deleteAll
source: Delete all Apple lyric credentials
zh_hans: 删除全部 Apple 歌词凭据

# lyrics.credential.delete.help
source: Deletes the selected Keychain credential only. Spotify login, cached lyrics and manual matches are not deleted.
zh_hans: 仅删除所选 Keychain 凭据；不删除 Spotify 登录、歌词缓存和人工匹配。

# lyrics.error.notFound
source: No synchronized lyrics found.
zh_hans: 没有找到同步歌词。

# lyrics.error.malformed
source: Invalid or unsupported lyric data.
zh_hans: 歌词数据损坏或格式不受支持。

# lyrics.error.tooLarge
source: The lyric response exceeded safety limits.
zh_hans: 歌词响应超过安全限制。

# lyrics.error.transport
source: Network request failed. Existing lyrics are retained.
zh_hans: 网络请求失败，已有歌词会保留。

# lyrics.error.credentials
source: Configure or renew your Apple Music media-user-token.
zh_hans: 请配置或更新 Apple Music media-user-token。

# lyrics.error.bearer
source: Public Catalog bearer unavailable, invalid or expired.
zh_hans: 公共 Catalog bearer 获取失败、无效或已过期。

# lyrics.error.account
source: The Apple Music account credential was rejected.
zh_hans: Apple Music 账号凭据验证失败。

# lyrics.error.permission
source: Apple Music lyric access denied; check storefront, subscription and lyric permissions.
zh_hans: Apple Music 歌词访问被拒绝，请检查地区、订阅和歌词权限。

# lyrics.error.cache
source: Cache could not be read or saved. Current lyrics remain usable; changes may not survive a restart.
zh_hans: 缓存读取或保存失败。当前歌词仍可使用，但修改可能无法在重启后保留。

# catalog.home
source: Home
zh_hans: 首页

# catalog.search
source: Search
zh_hans: 搜索

# catalog.library
source: Library
zh_hans: 音乐库

# catalog.tracks
source: Songs
zh_hans: 歌曲

# catalog.albums
source: Albums
zh_hans: 专辑

# catalog.artists
source: Artists
zh_hans: 艺人

# catalog.playlists
source: Playlists
zh_hans: 歌单

# catalog.myPlaylists
source: My playlists
zh_hans: 我的歌单

# catalog.savedTracks
source: Liked songs
zh_hans: 喜欢的歌曲

# catalog.savedAlbums
source: Saved albums
zh_hans: 已保存专辑

# catalog.followedArtists
source: Followed artists
zh_hans: 关注艺人

# catalog.recent
source: Recently played
zh_hans: 最近播放

# catalog.topTracks
source: On repeat
zh_hans: 最近常听

# catalog.topRange
source: Your top tracks over approximately the last four weeks.
zh_hans: 你在最近约四周内最常听的歌曲。

# catalog.seeAll
source: See all
zh_hans: 查看全部

# catalog.loadMore
source: Load more
zh_hans: 加载更多

# catalog.empty
source: No music here yet
zh_hans: 暂无音乐内容

# catalog.searchPrompt
source: Songs, albums, artists and playlists
zh_hans: 搜索歌曲、专辑、艺人和歌单

# catalog.searchType
source: Search type
zh_hans: 搜索类型

# catalog.unknown
source: Unknown title
zh_hans: 未知名称

# catalog.openSpotify
source: Open in Spotify
zh_hans: 在 Spotify 中打开

# catalog.unsupported
source: Only Spotify music is supported
zh_hans: 仅支持 Spotify 音乐内容

# catalog.restricted
source: Unavailable for this account or region
zh_hans: 当前账号或地区不可播放

# catalog.metadataOnly
source: Spotify has not made these tracks available to this app. Open in Spotify to continue.
zh_hans: Spotify 未向本应用开放这些曲目，请在 Spotify 中打开。

# catalog.error.signIn
source: Your Spotify session is unavailable. Sign out and sign in again in Settings.
zh_hans: Spotify 会话不可用，请在设置中退出并重新登录。

# catalog.error.forbidden
source: Spotify denied access. Check the app's user access list and sign in again to grant library permissions.
zh_hans: Spotify 拒绝访问。请检查应用用户访问列表，并重新登录以授予音乐库读取权限。

# catalog.error.unavailable
source: This content is no longer available to this app.
zh_hans: 本应用暂时无法访问此内容。

# catalog.error.quota
source: Spotify's app quota is exhausted. Automatic retries have stopped. Check the developer dashboard before reconnecting.
zh_hans: Spotify 应用配额已耗尽，已停止自动重试。请检查开发者控制台后再重新连接。

# catalog.error.rateLimit
source: Spotify is limiting requests. Retry after:
zh_hans: Spotify 正在限制请求频率，请在此时间后重试：

# settings.login
source: Login
zh_hans: 登录

# settings.login.spotify
source: Sign in to Spotify
zh_hans: 登录到Spotify

# settings.login.authorize
source: Authorize and sign in
zh_hans: 授权登录

# settings.login.saveHelp
source: Your Client ID is saved on this device when you tap Authorize. Changing it disconnects the current account and requires a new sign-in.
zh_hans: 点击“授权登录”会在本机保存 Client ID；更换 ID 会断开当前账户，并使用新配置重新授权。

# settings.login.apiHelp
source: Spotify API setup: 1. Open the Spotify Developer Dashboard and create an app. Select Web API and iOS where available. 2. In the app settings, add and save this exact Redirect URI:
zh_hans: Spotify API 配置方法： 1. 打开 Spotify Developer Dashboard，创建应用，并在适用的选项中勾选 Web API 和 iOS。 2. 在应用设置的 Redirect URIs 中添加并保存以下地址，须完全一致：

# settings.login.bundleHelp
source: For the iOS integration, enter this app's Bundle ID (use the actual value after re-signing):
zh_hans: 配置 iOS 集成时填写本应用的 Bundle ID（重新签名后以实际值为准）：

# settings.login.finishHelp
source: 3. Copy the Client ID into the field above, then tap Authorize and sign in. 4. In Development Mode, add the Spotify account you will use to the app's user access list if required. Playback controls may require Spotify Premium. No Client Secret is needed: sign-in uses PKCE and the system browser.
zh_hans: 3. 将 Client ID 复制到上方输入框，再点击“授权登录”。 4. Development Mode 下，如有要求，请在应用的用户访问列表中添加要登录的 Spotify 账户。播放控制可能需要 Spotify Premium。 无需填写 Client Secret；登录使用 PKCE 和系统网页授权。

# settings.login.dashboard
source: Open Spotify Developer Dashboard
zh_hans: 打开 Spotify 开发者控制台

# settings.login.documentation
source: Spotify API setup documentation
zh_hans: Spotify API 官方配置说明

# common.done
source: Done
zh_hans: 完成

# common.ok
source: OK
zh_hans: 好

# error.title
source: Spotify Error
zh_hans: Spotify 错误

# error.offline
source: The network is unavailable. Playback will resynchronize when you are online.
zh_hans: 网络不可用，恢复联网后将重新同步播放状态。

# error.spotifyAppRemoteUnavailable
source: Spotify App Remote is unavailable. Using Spotify Connect instead.
zh_hans: Spotify App Remote 不可用，已改用 Spotify Connect。

# error.spotifyConfigurationMissing
source: Spotify Client ID is not configured.
zh_hans: 尚未配置 Spotify Client ID。

# error.spotifyInvalidResponse
source: Spotify returned an unexpected response.
zh_hans: Spotify 返回了无法识别的响应。

# error.spotifyNoActiveDevice
source: No active Spotify device. Open Spotify on a device or choose a Connect device.
zh_hans: 没有活跃的 Spotify 设备。请在某台设备上打开 Spotify，或选择 Connect 设备。

# error.spotifyNoPlayback
source: Nothing is currently playing in Spotify.
zh_hans: Spotify 当前没有播放内容。

# error.spotifyNotAuthorized
source: Connect your Spotify account first.
zh_hans: 请先连接 Spotify 账户。

# error.spotifyPremiumRequired
source: This playback command requires Spotify Premium.
zh_hans: 该播放操作需要 Spotify Premium。

# error.spotifyRateLimited
source: Spotify is temporarily rate limiting requests. Try again shortly.
zh_hans: Spotify 暂时限制了请求频率，请稍后重试。

# error.spotifyRestrictedDevice
source: The selected Spotify device does not allow this control.
zh_hans: 所选 Spotify 设备不允许执行该控制。

# error.spotifyRedirectInvalid
source: The app's Spotify callback URI is invalid. Please install a corrected build; re-entering the Client ID will not fix this.
zh_hans: 应用内的 Spotify 回调地址配置无效，请安装修复后的版本；重新输入 Client ID 无法解决此问题。

# error.spotifyTokenExpired
source: The Spotify session expired. Connect the account again.
zh_hans: Spotify 会话已失效，请重新连接账户。

# error.spotifyTransport
source: Spotify could not complete the request.
zh_hans: Spotify 无法完成请求。

# foundation.failed
source: Foundation check failed
zh_hans: 基础检查失败

# foundation.loading
source: Checking project foundation…
zh_hans: 正在检查工程基础…

# foundation.section.configuration
source: Local configuration
zh_hans: 本地配置

# foundation.section.project
source: Project foundation
zh_hans: 工程基础

# foundation.spotifyClientID.help
source: Open Settings → Login → Sign in to Spotify, enter your Client ID, and authorize in the browser.
zh_hans: 打开右上角设置 → 登录 → 登录到Spotify，填写 Client ID 后进行网页授权。

# foundation.spotifyOnly
source: Spotify-only boundary
zh_hans: 仅连接 Spotify

# foundation.swiftui
source: Native SwiftUI lifecycle
zh_hans: 原生 SwiftUI 生命周期

# player.authorizing
source: Waiting for Spotify authorization…
zh_hans: 正在等待 Spotify 授权…

# player.chooseDevice
source: Choose a device
zh_hans: 选择设备

# player.configurationRequired
source: Spotify configuration required
zh_hans: 需要配置 Spotify

# player.connect
source: Connect Spotify
zh_hans: 连接 Spotify

# player.connectDescription
source: Authorize once to view playback, control Spotify, and switch Connect devices.
zh_hans: 授权后即可查看播放状态、控制 Spotify 并切换 Connect 设备。

# player.connectTitle
source: Connect your Spotify account
zh_hans: 连接你的 Spotify 账户

# player.connectionFailed
source: Could not connect to Spotify
zh_hans: 无法连接 Spotify

# player.deviceLoadFailed
source: Could not load devices
zh_hans: 无法载入设备

# player.deviceRestricted
source: Controls are restricted on this device
zh_hans: 此设备限制远程控制

# player.loadingDevices
source: Loading Spotify devices…
zh_hans: 正在载入 Spotify 设备…

# player.next
source: Next
zh_hans: 下一首

# player.noDevices
source: No Spotify devices
zh_hans: 没有 Spotify 设备

# player.noDevicesDescription
source: Open Spotify on a phone, computer, speaker, or TV and refresh this list.
zh_hans: 请在手机、电脑、音箱或电视上打开 Spotify，然后刷新列表。

# player.noPlayback
source: Nothing playing
zh_hans: 暂无播放内容

# player.noPlaybackDescription
source: Start music in Spotify or choose an active Connect device.
zh_hans: 请在 Spotify 中开始播放，或选择一个活跃的 Connect 设备。

# player.pause
source: Pause
zh_hans: 暂停

# player.play
source: Play
zh_hans: 播放

# player.previous
source: Previous
zh_hans: 上一首

# player.refresh
source: Refresh
zh_hans: 刷新

# player.refreshingSession
source: Refreshing Spotify session…
zh_hans: 正在刷新 Spotify 会话…

# player.source.appRemote
source: Live via Spotify App Remote
zh_hans: 通过 Spotify App Remote 实时同步

# player.source.webAPI
source: Synced via Spotify Web API
zh_hans: 通过 Spotify Web API 同步

# player.title
source: Spotify Player
zh_hans: Spotify 播放器

# player.tryAgain
source: Try again
zh_hans: 重试

# settings.about
source: About
zh_hans: 关于

# settings.account
source: Account
zh_hans: 账户

# settings.clientSecretHelp
source: Do not enter a Client Secret in an iPhone app. Native apps cannot keep it secret, so AMLL uses Spotify's PKCE flow and stores only the resulting token in Keychain. A Client Secret belongs on a trusted server only.
zh_hans: 请勿在 iPhone 应用中输入 Client Secret。原生应用无法安全保密它，因此 AMLL 使用 Spotify 的 PKCE 流程，只在钥匙串中保存授权令牌。Client Secret 只能放在可信服务器上。

# settings.configured
source: Configured
zh_hans: 已配置

# settings.connected
source: Connected
zh_hans: 已连接

# settings.disconnected
source: Not connected
zh_hans: 未连接

# settings.logout
source: Disconnect Spotify account
zh_hans: 断开 Spotify 账户

# settings.login.web
source: Sign in on the web
zh_hans: 通过网页授权登录

# settings.noLocalPlayback
source: This app does not scan, import, or play local audio files.
zh_hans: 本应用不会扫描、导入或播放本地音频文件。

# settings.notConfigured
source: Not configured
zh_hans: 未配置

# settings.open
source: Settings
zh_hans: 设置

# settings.pkce
source: Secure browser sign-in with PKCE
zh_hans: 使用 PKCE 安全网页授权

# settings.playback
source: Playback boundary
zh_hans: 播放边界

# settings.redirectURI
source: Redirect URI
zh_hans: 回调 URI

# settings.security
source: Login security
zh_hans: 登录安全

# settings.sourceCode
source: Source code
zh_hans: 源代码

# settings.spotifyOnly
source: Spotify connection only
zh_hans: 仅连接 Spotify

# settings.version
source: Version
zh_hans: 版本

# status.actionRequired
source: Action required
zh_hans: 需要配置

# status.ready
source: Ready
zh_hans: 已就绪

# tab.foundation
source: Foundation
zh_hans: 基础

# tab.player
source: Player
zh_hans: 播放器

# tab.settings
source: Settings
zh_hans: 设置
